index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Martis Blog</title>
<!-- 2016-08-04 kt 10:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Martynas Drobulis" />
</head>
<body>
<div id="content">
<h1 class="title">Martis Blog</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Your own personal Cloud</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Your own personal Cloud</h2>
<div class="outline-text-2" id="text-1">
<p>
I've was captivated by the idea of hosting my own cloud&#x2026;
You know, when you wana share or store files while google or dropbox are not included.
</p>

<p>
While learining tricks of Emacs and Org-mode I've heard a 
speaker mention ownCloud. Some time later I was thinking  
how would I host a silent server so that i could sleep next to it.
Raspberry PI was a great idea. 
</p>

<ul class="org-ul">
<li><code>[X]</code> Sleep friendly hosting - Fanless Raspberry PI
</li>
</ul>

<p>
Just one problem. No external keyboard i could connect to PI.
To my releaf - Raspberrian OS comes with ssh enabled by default  
</p>

<ul class="org-ul">
<li><code>[X]</code> Plug a network cabel,
</li>
<li><code>[X]</code> launch PuTTy, <code>Yes I use M$ Windows</code>
</li>
<li><code>[X]</code> ssh connect.
</li>
</ul>

<p>
default logins are  pi:raspberry
</p>

<p>
Next up - service installation and configuration.
</p>

<ul class="org-ul">
<li><code>[X]</code> :# apt-get install ownCloud
</li>
<li><code>[X]</code> <a href="http://">http://</a>&lt;pi IP Address&gt;/ownCloud
</li>
</ul>

<p>
You get a configuration page where you get to setup your 
</p>

<ul class="org-ul">
<li>Admin logins
</li>
<li>Storage dir
</li>
<li>Mysql server connection credencials
</li>
</ul>

<p>
Using 8Gb SD card as default storage is a bad idea.
</p>

<p>
Portable Maxtor 1TB HDD for $59 plugs right in to Rasberry with no extra power required.
FYI - PI reboots on contact with this power hog. So be sure to <code>$sudo halt</code> the device before 
plugging in a 1TB memory extention.
</p>

<p>
Next mounting the drive&#x2026;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Martynas Drobulis</p>
<p class="date">Created: 2016-08-04 kt 10:42</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
